Revit 2024 API
LineLoad.SetPoints Method
 Sets start and end point of the line load.
Namespace: Autodesk.Revit.DB.Structure
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2016
Syntax
C#
public bool SetPoints(
	XYZ startPoint,
	XYZ endPoint
)
Visual Basic
Public Function SetPoints ( _
	startPoint As XYZ, _
	endPoint As XYZ _
) As Boolean
Visual C++
public:
bool SetPoints(
	XYZ^ startPoint,
	XYZ^ endPoint
)
Parameters
startPoint
Type: Autodesk.Revit.DB.XYZ
 The start point.
endPoint
Type: Autodesk.Revit.DB.XYZ
 The end point.
Return Value
 Returns true if successful, false otherwise.
Remarks
 This method works with hosted line load only. This method works for loads which are not constrained to their host. The curve of the resulted load will be a line.
Exceptions
Exception | Condition
Autodesk.Revit.Exceptions.ArgumentException |  Thrown when the end point is equal to the start point.
Autodesk.Revit.Exceptions.ArgumentNullException |  A non-optional argument was null
Autodesk.Revit.Exceptions.InvalidOperationException |  This LineLoad is not a hosted load. -or- This LineLoad is a constrained load.
See Also
LineLoad Class
Autodesk.Revit.DB.Structure Namespace